Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་བས་ལྷག་པའི་འོད་ཅེས་བྱ་བ་སྙིང་རྗེ་ཅན་སེམས་ཅན་འདྲེན་པ་མེད་པ་རྣམས་ཀྱི་འདྲེན་པར་འགྱུར་བར་འདོད་པ་སྟོན་པ་དང་བྲལ་བ་རྣམས་ཀྱི་སྟོན་པར་འགྱུར་བར་འདོད་པ། མུན་པ་རྣམས་ལ་སྣང་བར་བྱེད་པར་འདོད་པ་མིག་ཕྱུང་བ་རྣམས་ལ་མིག་སྐྱེད་པར་འདོད་པ། ལམ་རབ་ཏུ་ཉམས་པ་རྣམས་ལ་ལམ་ཡང་དག་པར་སྟོན་པར་འདོད་པ། འཁོར་བར་རབ་ཏུ་ཞུགས་པ་རྣམས་ལ་འཁོར་བ་ལས་འདའ་བར་འདོད་པ།
en: At that time a compassionate bodhisattva named Light Superior to the Moon joined and remained in the assembly. He wanted to be a guide for those who lacked a guide, to be a teacher for those who lacked a teacher, to be a light for those in darkness, to give vision to those who lacked vision, to show the true path to those on wrong paths, and to bring those immersed in cyclic existence out of cyclic existence.

source: སྙིང་རྗེ་ཆེན་པོ་ཐོབ་པས་ལུས་ཡོངས་སུ་གཏོང་བ་ལ་ལུས་དང་སྲོག་ལ་མི་ལྟ་བ་ཞིག་འཁོར་དེ་ཉིད་དུ་འདུས་ཏེ་ འདུག་པར་གྱུར་ཏོ། །
en: Having achieved great compassion, he had no regard for life or limb as he sacrificed his body.

source: སེམས་ཅན་དག་གི་དོན་གྱི་ཕྱིར་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ།
en: For the sake of beings he stood up from his seat and draped his shawl over one shoulder.

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མི་ཤེས་པ་སྟོན་པ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then, kneeling on his right knee, he bowed toward the thus-gone Teacher of Ignorance with his palms together, and made this inquiry in the form of a song:

source: སེམས་ཅན་སྙིང་པོ་དཔལ་ཆེ་གཟི་ཆེ་འོད་ཆ་ལྡན། །
en: “ ‘Quintessential being, you are glorious, splendorous, and radiant.

source: སེམས་ཅན་རྣམས་ལ་ཐུགས་བརྩེ་མགོན་པོ་ཐུགས་རྗེ་ཅན། །
en: You are a loving, compassionate protector of sentient beings.

source: མཁས་པ་འཇིགས་མེད་སངས་རྒྱས་ཡེ་ཤེས་ཁྱོད་ལ་ཞུ། །
en: With your fearless knowledge and awakened wisdom, I ask you:

source: སངས་རྒྱས་བྱང་ཆུབ་ཚོལ་བར་སྤྱད་མཆོག་སྤྱོད་པའི་ཚེ། །རྣ
en: When carrying out the supreme practice in pursuit of the buddhas’ awakening,

source: མ་འདྲེན་བྱང་ཆུབ་སེམས་དཔས་ལས་དགེ་ཅི་བགྱི་ན། །
en: “ ‘O Guide, what good deeds should bodhisattvas carry out?

source: མཁས་པ་ཉོན་མོངས་ཀུན་འབྱུང་ཤེས་མཆོག་ཇི་ལྟར་འཐོབ། །
en: Wise one, how is supreme knowledge of the origin of affliction gained?

source: མགོན་པོ་ཀུན་འབྱུང་མཁྱེན་པ་ཇི་ལྟར་བདག་ཐོས་འཚལ། །
en: Protector, I wish to hear, what is knowledge of the origin like?

source: ལེགས་ཞུས་དེ་ནི་ཐུགས་རྗེ་བསྐྱེད་དེ་བདག་ལ་གསུངས། །
en: Please have compassion for my question and tell me.’

source: སྟོན་པ་འཇིག་རྟེན་ཀུན་མཁྱེན་ཐོབ་པ་ཐུགས་རྗེ་ཅན།
en: “The compassionate teacher and knower of the whole world

source: དེ་ཡིས་རྟོག་ལམ་བཅད་དེ་དེ་ཉིད་མཁྱེན་པས་བསྟན། །
en: Cut the questioner’s train of thought and explained wisely:

source: ཀུན་ནས་ཉོན་མོངས་ཤེས་ལ་སོ་སོར་བགེད་པར་ལྡན། །ནད་པ་ལ་ནི་ཟས་སྐོམ་གོས་ཀྱིས་བགེད་བྱས་པ། །
en: “ ‘To understand affliction, one must share — Share food, drink, and clothing with the sick.

source: དགེ་བའི་ལས་དེས་བྱས་པ་བྱང་ཆུབ་ཡོངས་སུ་བསྔོ། །
en: After doing those good deeds, dedicate them to awakening.

source: བློ་ལྡན་ཤེས་པ་དེས་ནི་ཉོན་མོངས་རྒྱུ་ཤེས་སོ། །
en: The wise with such understanding will know the causes of affliction.’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན།
en: “What do you think, Maudgalyāyana?

source: བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་ལས་ལྷག་པའི་འོད་དུ་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། དེ་ལྟར་མི་བལྟ་སྟེ།
en: In case you may think that at that time the bodhisattva named Light Superior to the Moon was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་ལས་ལྷག་པའི་འོད་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the bodhisattva called Light Superior to the Moon.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་དགེ་བའི་རྩ་བ་མངོན་པར་འདུས་བྱས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སོ་སོར་བགེད་པ་བྱས་ནས་དབྱེ་བ་མེད་པར་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should create roots of virtue, share with other bodhisattvas, and then dedicate those deeds exclusively to awakening.

source: མཽད་གལ་གྱི་བུ་ངས་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundlessly numerous roots of virtue in order to understand cessation as related to knowledge of affliction. I did this by wondering, ‘How can I fully awaken to unsurpassed and perfect buddhahood, and then teach beings correctly?’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། རྒྱལ་པོ་བློ་གྲོས་དག་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king named Pure Intellect.

source: དེའི་བློན་པོ་རྟོག་པ་ཞི་བ་ཞེས་བྱ་བ་མཇལ་དུ་མ་དང་ཐབ་མོ་ལ་དབང་བ་ཞིག་བྱུང་ངོ་། །
en: He had a minister named Calm Thinker, who was in charge of conciliation and dispute.

source: དེ་བྱ་བ་ཐམས་ཅད་ཀྱི་འཇིག་པ་རྟོག་སྟེ།
en: He knew the transience of all actions.

source: དེ་ཡང་ཚིག་བརྗོད་པ་ཙམ་གྱིས་ཕ་རོལ་གྱི་བྱ་བ་འཇིག་པར་བྱེད།
en: Just by speaking a few words he could put an end to others’ activities.

source: གང་སེམས་བསྐྱེད་པ་དེ་ཚིག་བརྗོད་ཅིང་ཚིག་སྨྲས་པས། དེའི་བྱ་བ་ངེས་པར་བྱེད་དེ་འདི་ལྟ་སྟེ་དཔེར་ན་མི་དག་གང་བསམས་པ་དེ་སྨྲའོ། །
en: He would say simply whatever came to his mind and, sure enough, things would happen accordingly. He was like a person who says whatever he thinks.

source: སྐྱེས་བུ་མཁས་པ་དག་འདི་ནས་དེ་ཉིད་ལུང་སྟོན་ཅིང་འཆད་དོ། །
en: In this way, based on his statements, wise people would make predictions and declarations.

source: དེ་བཞིན་དུ་རྒྱལ་པོའི་བློན་པོ་རྟོག་པ་ཞི་བ་དེ་ཚིག་ཐམས་ཅད་འགོག་པར་རྟོག་གོ། །
en: Similarly, the royal minister named Calm Thinker understood the cessation of all words.

source: དེ་ནས་རྒྱལ་པོ་བློ་གྲོས་དག་པ་དེའི་བྱ་བ་གང་བྱུང་བ་དེ་དག་ཐམས་ཅད་བློན་པོ་རྟོག་པ་ཞི་བ་ལ་འཆོལ་ལོ། །
en: So whatever affairs came about, King Pure Intellect would inquire of the minister Calm Thinker.

source: དེ་དེ་དག་བྱེད་དེ་བྱ་བ་གཞན་དུ་འགྱུར་བ་ནི་མེད་དོ། །
en: He would then act accordingly, and things would always turn out accordingly.

source: དེ་ལྟར་རྒྱལ་པོ་དེའི་བློན་པོ་རྒྱལ་པོ་བློ་གྲོས་རྣམ་དག་དེའི་ཤིན་ཏུ་ངེས་པའི་ཕྱིར་གནོད་པ་མེད་པ་ཞིག་བྱུང་བར་གྱུར་ཏོ། །
en: In that way, because King Pure Intellect’s minister was so certainly correct, the king was never harmed.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོའི་བློན་པོ་རྟོག་པ་ཞི་བ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། དེ་ལྟར་མི་བལྟ་སྟེ།
en: In case you may think that at that time the royal minister named Calm Thinker was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོའི་བློན་པོ་རྟོག་པ་ཞི་བ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Because in those days I was the royal minister called Calm Thinker.

source: ངས་རྒྱལ་སྲིད་འཇིག་པ་དེ་བྱ་བ་ཡོངས་སུ་བརྟགས་པས་ཤིན་ཏུ་འཕེལ་བར་བྱས་ཤིང་ཡོངས་སུ་བསྐྱངས་སོ། །
en: By analyzing the affairs of the transient kingdom, I was able to protect it and help it flourish.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་སྲིད་པ་འཇིག་པའི་མཐའ་ལས་ཀུན་འབྱུང་བ་ཐམས་ཅད་ཀྱི་ཆོས་གང་ཡིན་པ་དེ་ཐམས་ཅད་ནི་འགོག་པའི་ཆོས་ཅན་ནོ་ཞེས་ཡོངས་སུ་བརྟག་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should analyze how everything that originates out of transient existence has the nature of cessation.

source: མཽད་གལ་གྱི་བུ་ངས་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནསདགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created countless different roots of virtue in order to understand the path that leads to cessation as related to knowledge of affliction. I did this by wondering, ‘How can I fully awaken to unsurpassed and perfect buddhahood, and then teach beings how to understand the path that leads to cessation as related to knowledge of affliction?’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་ཞེས་བྱ་བ་ནས།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there appeared in the world a thus-gone one named White Intellect;

source: དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་དེའི་སྐུ་ཚེའི་ཚད་ལོ་བྱེ་བ་ཕྲག་དགུ་བཅུར་གྱུར་ཏོ། །
en: The thus-gone White Intellect would live to be nine hundred million years.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བློ་གྲོས་དཀར་བ་དེའི་ཉན་ཐོས་འདུས་པ་དང་པོ་ནི་ཁྲི་ཕྲག་བརྒྱད་ཅུ་བྱུང་ངོ་། །
en: His first assembly of hearers numbered eight hundred thousand,

source: ཉན་ཐོས་འདུས་པ་གཉིས་པ་ནི་དགྲ་བཅོམ་པ་ཁྲི་བྱུང་ངོ་། །
en: the second assembly of hearers consisting of ten thousand worthy ones,

source: ཉན་ཐོས་འདུས་པ་གསུམ་པ་ནི་ཉན་ཐོས་འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་བྱུང་ངོ་། །
en: and the third assembly of six million eight hundred thousand hearers.

source: དེའི་ཚེ་རྒྱལ་པོ་མཁས་པའི་ཚུལ་གྱི་བུ་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་རི་བོང་ཚིག་ཅེས་བྱ་བ་བལྟ་ན་སྡུག་པ་བསྐལ་པ་གྲངས་མེད་པ་བདུན་ཅུ་རྩ་བདུན་དུ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ཞིག་བྱུང་ངོ་། །
en: At that time there was a king named Way of Knowledge who had a son, a handsome bodhisattva called Rabbit Words, who had created roots of virtue for seventy-seven incalculable eons.

source: དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་དེས་ས་ལ་ཞབས་བཞག་པ་ན། ས་ཆེན་པོ་འདི་རྣམ་པར་སྒྲ་འབྱིན་ལ། ཞབས་ཀྱི་འོག་ཏུ་གསེར་གྱི་པད་མ་འདབ་མ་སྟོང་ཡོད་པ་འབྱུང་ཞིང་བྱུང་མ་ཐག་ཏུ་ནུབ་པར་གྱུར་ཏོ། །
en: When the thus-gone White Intellect stepped on the ground, the earth would resound, and a thousand-petaled golden lotus would appear under his foot before immediately vanishing.

source: དེའི་ཚེ་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་འོད་ཀྱིས་རྒྱས་པར་གྱུར་ཏོ། །
en: At that time, the entire chiliocosm was pervaded by the Buddha’s light.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་ཐམས་ཅད་དུ་ཉིན་གཅིག་ལ་སྤོས་ཆུའི་ཆར་ལན་གསུམ་མངོན་པར་འབབ་བོ། །
en: Each day, a rain of perfumed water would fall three times everywhere in the buddha realm.

source: རླུང་གང་དག་ལྡང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ལྷའི་སྤོས་དང་ལྡན་པ་ལྡང་ངོ་། །
en: Everything the wind there blew on became suffused with a divine aroma.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྒྲ་གང་དག་འབྱུང་བ་དེ་དག་ཐམས་ཅད་མི་རྟག་པའི་སྒྲར་གོ་བར་བྱེད། སྡུག་བསྔལ་གྱི་སྒྲ་དང་། བདག་མེད་པའི་སྒྲར་གོ་བར་བྱེད་ཞི་བའི་སྒྲ་དང་། བདུད་རྩིའི་སྒྲར་གོ་བར་བྱེད་དོ། །སེམས་ཅན་དེ་དག་ཐམས་ཅད་སྒྲ་དེ་ལྟ་བུ་ཐོས་སོ། །
en: Every sound that occurred in the buddha realm was heard by the beings there as the words ‘impermanence,’ ‘suffering,’ ‘no-self,’ ‘peace,’ or ‘ambrosia.’

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཉལ་བ་ན་སངས་རྒྱས་ཀྱི་སྐུའི་ཞལ་ཉེ་བར་སྟོན་པར་མཛད་དེ།
en: In their sleep, the face of the Buddha would reveal itself to all beings in that realm.

source: བྱང་ཆུབ་སེམས་དཔའ་རི་བོང་ཚིག་གི་རྨི་ལམ་དུ་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་འཇིག་རྟེན་དུ་བྱུང་བར་མཐོང་ངོ་དེ་མཐོང་མ་ཐག་ཏུ་དེ་བཞིན་གཤེགས་པ་དེ་ལ་གཞལ་དུ་མེད་པའི་དགའ་བ་སྐྱེས་ཏེ
en: “The bodhisattva Rabbit Words had a dream in which he saw that the thus-gone White Intellect had appeared in the world, and immediately he felt immeasurable joy at seeing the Thus-Gone One.

source: དེ་དགའ་བ་སྐྱེས་ནས་གྲོང་མི་བསྡུས་སོ། །བསྡུས་ནས་སྨྲས་པ།
en: Elated, he gathered the townspeople, and said to them,

source: གྲོགས་པོ་དག་ཤེས་པར་གྱིས་ཤིག །
en: ‘Friends, listen!

source: དེ་བཞིན་གཤེགས་པ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བློ་གྲོས་དཀར་བ་ཞེས་བྱ་བ་ནས་རྒྱ་ཆེར་སྦྱར་ཏེ།
en: A learned and virtuous thus-gone one named White Intellect has appeared in the world;

source: དེ་རྒྱ་ཆེར་ཀུན་ནས་ཉོན་མོངས་པ་རབ་ཏུ་སྟོན་པར་མཛད་དེ།
en: He is widely explaining about affliction.

source: ཀུན་ནས་ཉོན་མོངས་པ་འདོད་ཆགས་དང་། ཀུན་ནས་ཉོན་མོངས་པ་ཞེ་སྡང་དང་། ཀུན་ནས་ཉོན་མོངས་པ་གཏི་མུག་དང་། ཀུན་ནས་ཉོན་མོངས་པ་ཉེས་པར་སྤྱད་པ་དང་། ཉོན་མོངས་པ་དེ་དག་གི་རྒྱུ་དང་བཅས་པ་སྟོན་པར་མཛད།
en: He explains the affliction of attachment, the affliction of anger, the affliction of ignorance, the affliction of misbehavior, and the cause of these afflictions.

source: ཀུན་ནས་ཉོན་མོངས་པ་དེ་དག་གི་འཇིག་པ་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་མཛད།
en: He teaches on the transience of these afflictions.

source: ཀུན་ནས་ཉོན་མོངས་པ་དེ་དག་གི་ངེས་པར་འབྱུང་བ་ཡང་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་མཛད་དོ། །
en: He teaches on the escape from these afflictions.

source: དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་དེ་ག་ལ་བ་དེར་ཁྱོད་དང་འདོང་བར་བྱའོ། །
en: You should all go to visit the thus-gone White Intellect!’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རི་བོང་ཚིག་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དང་། ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་དེ་ག་ལ་བ་དེར་དོང་ངོ་། །
en: “Then the bodhisattva Rabbit Words went before the Thus-Gone One with countless quintillions of other beings.

source: གཞོན་ནུ་རི་བོང་ཚིག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་དེ་རྒྱང་རིང་པོ་ཉིད་ནས་མཛེས་ཤིང་སྡུག་པ། དབང་པོ་ཞི་བ་ཐུགས་ཞི་བ།
en: Even from a distance, Prince Rabbit Words could see how handsome and attractive the blessed thus-gone White Intellect was, and how calm his faculties and mind were;

source: དུལ་བ་དང་། ཞི་གནས་མཆོག་བརྙེས་པ་དུལ་བ་དང་། ཞི་གནས་མཆོག་བརྙེས་པ་སྦས་པ་གླང་པོ་དབང་པོ་ཐུལ་བ། མཚོ་ལྟར་དང་བ། །དང་ཞིང་རྙོག་པ་མེད་པ། གསེར་གྱི་མཆོད་སྡོང་ལྟ་བུ། རྒྱ་མཚོ་ལྟར་རིན་པོ་ཆེས་ཡོངས་སུ་གང་བ། དབང་པོ་ལྟར་ལྷས་ཡོངས་སུ་བསྐོར་བ། ཚངས་པ་ལྟར་ཐུགས་ཞི་བར་མཐོང་ངོ་། །
en: how restrained he was; how calm he was due to having reached superior tranquility; how restrained his faculties were, concealed like those of an elephant, due to the superior tranquility he had gained; how he was lucid as a lake, clear and unsullied; how he was like a golden memorial, or like an ocean filled with gems; how he was like Indra, surrounded by gods; and how he was like Brahmā, his mind peaceful.

source: མཐོང་ནས་བཅོམ་ལྡན་འདས་དེ་ལ་དད་པ་ཤིན་ཏུ་བསྐྱེད་དེ། སེམས་བསྐྱེད་པ་བདག་གིས་དེ་བཞིན་གཤེགས་པ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་སང་སྤྱན་དྲང་ངོ་སྙམ་ནས། དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་དེ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Beholding the Blessed One, he felt utter faith for him, and formed the resolve, ‘I will invite the Thus-Gone One and the monastic saṅgha tomorrow.’

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: So he went before the blessed thus-gone White Intellect, bowed his head to the Blessed One’s feet and then stayed off to one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས། གཞོན་ནུ་རི་བོང་ཚིག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: From there, Prince Rabbit Words then supplicated the blessed thus-gone White Intellect with these words:

source: བཅོམ་ལྡན་འདས་བདག་ལ་ཐུགས་བརྩེ་བར་དགོངས་ཏེ།
en: “Blessed One, please consider me with compassion.

source: དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ། སང་གདུགས་ཚོད་ལ་གཤེགས་པར་ཅི་གནང་།
en: Will you please come for lunch tomorrow along with your saṅgha of monks?’

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་དེས་གཞོན་ནུ་རི་བོང་ཚིག་དེ་ལ་ཐུགས་བརྩེ་བར་དགོངས་ནས་གནང་ངོ་། །
en: “The blessed thus-gone White Intellect did consider Prince Rabbit Words with compassion, and assented.

source: དེ་ནས་གཞོན་ནུ་རི་བོང་ཚིག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་དེ་འཛུམ་པ་མཛད་པས་གནང་བར་རིག་ནས་བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Prince Rabbit Words knew that the blessed thus-gone White Intellect was agreeing by smiling, and so he bowed his head at the Blessed One’s feet.

source: བདག་གི་ཁྱིམ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། དེའི་མཚན་མོ་བཟའ་བ་དང་། བཅའ་བ་དང་། མྱང་བ་དང་། ཞིམ་པོ་གྱ་ནོམ་པ་རབ་ཏུ་མང་པོ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: Afterward, he returned to his home, where that night he arranged a cornucopia of delicious and sublime food and drink.

source: དགེ་སློང་རེ་རེ་ལ་ཡང་རས་བཅོས་བུ་སྟོང་ཕྲག་བརྒྱད་བརྒྱད་བསྡོགས་སོ། །
en: He also prepared eight thousand pieces of cotton fabric for each monk.

source: དེ་མཚན་མོ་དེ་འདས་ནས་བཅོམ་ལྡན་འདས་ལ་དུས་ལ་བབ་བོ་ཞེས་གསོལ་ཏེ།
en: The following morning, he informed the Blessed One that it was time.

source: བཅོམ་ལྡན་འདས་གཞོན་ནུ་རི་བོང་ཚིག་གི་དུས་ལ་བབ་ལགས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་གཞོན་ནུ་རི་བོང་ཚིག་གི་ཁྱིམ་དུ་གཤེགས་ནས་གདན་བཤམས་པ་དེ་ལ་བཞུགས་སོ། །
en: The blessed thus-gone White Intellect then went to Prince Rabbit Words’ house with his monastic saṅgha, where they sat on the mats prepared for them.

source: དེ་ནས་གཞོན་ནུ་རི་བོང་ཚིག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་དེ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་གདན་ལ་བཞུགས་པར་རིག་ནས། བཟའ་བ་དང་། བཅའ་བ་དང་། མྱང་བ་ཞིམ་པོ་མང་པོས་ཡང་དག་པར་བྲིམས་ཤིང་ཡང་དག་པར་ཚིམ་པར་བྱས་སོ། །
en: Aware that the blessed thus-gone White Intellect and his monastic saṅgha were situated on their mats, Prince Rabbit Words satisfied them with the delicious food and drink he offered them.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བས་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་པས་ཟས་ཀྱི་སྣོད་གཅིག་ལས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ཐམས་ཅད་ཡང་དག་པར་ཚིམ་པར་གྱུར་ཏོ། །
en: Then, in a display of his magical powers , the blessed thus-gone White Intellect made it so that the Buddha and everyone else, including the saṅgha of monks, could be fed from just one dish of food.

source: དེ་ནས་གཞོན་ནུ་རི་བོང་ཚིག་གིས་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་དེ་ལྟ་བུ་དག་མཐོང་ནས། ཀྱེ་མ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་འདི་ལྟ་བུས་སེམས་ཅན་གདུལ་བར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་བོ། །
en: “Witnessing such a feat of magical powers , Prince Rabbit Words made the prayer, ‘May I fully awaken to unsurpassed and perfect buddhahood, and then guide beings with such feats of magic!’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་དེས་གཞོན་ནུ་རི་བོང་ཚིག་གིས་འདི་ལྟ་བུའི་སེམས་བསྐྱེད་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་མཛད་དེདེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །
en: Then, because Prince Rabbit Words had formed such a resolve, the thus-gone White Intellect predicted his unsurpassed and perfect awakening.

source: དེ་དགེ་བའི་རྩ་བའི་ཤུགས་ཀྱིས་ཏ་ལ་བདུན་སྲིད་ཙམ་དུ་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ནས་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: Due to his roots of virtue, he levitated to the height of seven palm trees, and then praised the thus-gone White Intellect with these verses:

source: བདེ་གཤེགས་མཁས་མཆོག་ཡེ་ཤེས་དམ་པ་དཔག་ཏུ་མེད། །
en: “ ‘Blissful One, you are supremely learned; your sublime wisdom is limitless.

source: གང་གིས་མགོན་པོ་མཐོང་སྟེ་བདག་གིས་དགེ་བ་བགྱིས། །
en: Protector, whoever beholds you creates virtue.

source: མི་མཆོག་དཔག་ཏུ་མེད་ལ་འདི་ལྟར་བསྟོད་པ་ནི། །
en: Supreme and unexcelled man, my praise to you is this:

source: ཡོན་ཏན་མཆོག་རབ་མངའ་བ་ཁྱོད་འདྲ་འཇིག་རྟེན་མེད། །
en: With your superior qualities, you are peerless in this world.

source: འདི་ལྟར་བདག་ཀྱང་ཡོན་ཏན་དཔག་ཏུ་མེད་གྱུར་ཅིག །
en: “ ‘May I also gain your limitless qualities.

source: འགྲོ་བ་ཀུན་གྱི་སྡུག་བསྔལ་ཐར་བགྱིད་འདྲེན་པ་དང་། །ལམ་ཆེན་ཡན་ལག་བརྒྱད་དང་ལྡན་པ་ཞི་བ་ཡིས། །སེམས་ཅན་སྡུག་བསྔལ་ལས་འདྲེན་མྱ་ངན་འདས་བགྱིད་ཤོག །
en: May all beings be guided from their suffering to nirvāṇa By the guide who liberates beings from suffering, And the great eightfold path.’

source: དེའི་ཚེ་དེའི་དུས་ན་གཞོན་ནུ་རི་བོང་ཚིག་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time Prince Rabbit Words was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན། གཞོན་ནུ་རི་བོང་ཚིག་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was known as Prince Rabbit Words.

source: ངས་ཀུན་ནས་ཉོན་མོངས་པ་བསལ་ནས་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དཀར་བ་དེ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པར་མཆོད་སྟོན་གསོལ། །
en: I eliminated the afflictions, offered a feast to the thus-gone White Intellect and his saṅgha of monks,

source: ཚིགས་སུ་བཅད་པས་ཀྱང་བསྟོད་དོ། །
en: and then praised him in verse.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔས་ཀུན་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་བསལ་ནས་དེ་བཞིན་གཤེགས་པ་ལ་བཀུར་སྟི་བྱ།
en: Therefore, Maudgalyāyana, bodhisattvas should eliminate all the afflictions and then venerate the thus-gone ones.

source: མཽད་གལ་གྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཀུན་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སེལ་བ་དེ་ནི་གནོད་སེམས་ཅན་དུ་མི་འགྱུར་རོ། །
en: Maudgalyāyana, a bodhisattva who eliminates all the afflictions will possess no malice.”

source: མཽད་གལ་གྱི་བུ་ངས་རྣམ་པར་བྱང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created unfathomably numerous roots of virtue in order to understand purification.

source: སེམས་ཅན་རྣམས་ལ་རྣམ་པར་བྱང་བ་ཤེས་པ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: I did this by wondering, ‘How can I fully awaken to unsurpassed and perfect buddhahood, and then teach beings knowledge of purification?’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཏོག་ཅེས་བྱ་བ་ནས།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there appeared in the world a thus-gone one named Stainless Zenith;

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཏོག་དེའི་སྐུ་ཚེའི་ཚད་ལོ་བྱེ་བ་ཕྲག་དྲུག་ཅུར་གྱུར་ཏོ། །
en: The thus-gone Stainless Zenith would live to be six hundred million years.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཏོག་དེའི་ཉན་ཐོས་འདུས་པ་དང་པོ་ནི་ཉན་ཐོས་དྲུག་འབུམ་བྱུང་ངོ་། །
en: His first assembly of hearers numbered six hundred thousand,

source: ཉན་ཐོས་འདུས་པ་གཉིས་པ་ནི་ཉན་ཐོས་བརྒྱད་འབུམ་བྱུང་ངོ་། །
en: the second assembly of hearers numbered eight hundred thousand,

source: ཉན་ཐོས་འདུས་པ་གསུམ་པ་ནི་ས་ཡ་ཐམ་པ་བྱུང་ངོ་། །
en: and the third assembly one million hearers.

source: བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་ནི་དེའི་ཉིས་གྱུར་ཏོ། །
en: His assemblies of bodhisattvas were double those.

source: དེའི་ཚེ་རྒྱལ་པོའི་བུ་ལྗོན་པ་ཞེས་བྱ་བ་སངས་རྒྱས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་རྣམས་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་སྨོན་ལམ་གྱིས་ཡང་དག་པར་རབ་ཏུ་གནས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པར་སྨོན་ལམ་གྱིས་ཡང་དག་པར་རབ་ཏུ་གནས་པ་ཞིག་བྱུང་ངོ་། །
en: “At that time there was a prince named Druma, who had created roots of virtue with countless tens of thousands of buddhas and who prayed for a pure buddha realm as well as an inexpressible buddha realm.

source: དེས་འདི་ལྟར་སྨོན་ལམ་བཏབ་སྟེ།
en: He aspired,

source: གང་གི་ཚེ་སེམས་ཅན་དག་མགོན་མེད་པར་གྱུར་ཅིག་སྐྱབས་མེད་པ་དང་། དཔུང་གཉེན་མེད་པ་དང་། ངན་སོང་ལ་གཞོལ་བ་དང་། ངན་སོང་ལ་འབབ་པ་དང་། ངན་སོང་ལ་བབ་པར་གྱུར་པ་དེའི་ཚེ་བདག་གིས་བསྐྱེད་པ་འདི་སེམས་ཅན་གནས་མེད་པ་དེ་རྣམས་ཀྱི་གནས་སུ་གྱུར་ཅིག །སེམས་ཅན་མགོན་མེད་པ་རྣམས་ཀྱི་མགོན་དུ་གྱུར་ཅིག །སེམས་ཅན་ངན་སོང་དུ་རབ་ཏུ་ལྷུང་བ་རྣམས་ཀྱི་འདྲེན་པར་གྱུར་ཅིག །
en: ‘When beings have fallen, descended, and dropped down into the lower states—without protection, without a savior, without any aid—at that time may I become a support for those who lack support, a protector for those who lack protection, and a guide for those who have fallen into the lower states!’

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོའི་བུ་ལྗོན་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time Prince Druma was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོའི་བུ་ལྗོན་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was known as Prince Druma.

source: ངས་དམ་པའི་ཆོས་རྣམ་པར་འཇིག་པའི་དུས་སུ་སེམས་ཅན་རྣམས་རྗེས་སུ་བསྲུང་བར་བྱ་བའི་ཕྱིར་དང་། སེམས་ཅན་ལ་ཕན་པར་བྱ་བའི་ཕྱིར་འདི་ལྟར་དགེ་བའི་རྩ་བ་རྒྱ་ཆེ་ཞིང་འདི་ལྟར་བདག་ཉིད་ཆེ་བ་དེ་དག་ཡོངས་སུ་བསྔོས་སོ། །
en: In that way, when the true Dharma was on the verge of perishing, I dedicated such extensive roots of virtue and such greatness toward protecting and helping sentient beings.
